/*
Создайте пакет p1, в нем класс A. В пакете p1 создайте подпакет p2, в нем
класс B со static элементами. В подпакете p2 создайте подпакет p3, в нем
класс C. Создайте новый пакет p4, в нем класс D. В пакете p4 создайте
подпакет p5, в нем класс E. Внетри класса D напишите код, который
будет задействовать любые элементы классов A, C, E, а также static
элементы класса B. Используя выражения import и import static,
работайте с неполными именами классов.
 */

package HomeWork.Lesson10;

public class Test1 {

}
